<script>
    import { UnorderedList, ListItem, Link } from "carbon-components-svelte";
</script>

<svelte:head>
    <title>アジ鯖公式サイト｜全体サーバールール</title>
</svelte:head>

<h1>全体サーバールール</h1>

<p>
    アジ鯖のMinecraftサーバー全体で適用されるルールです。<br>
    アジ鯖所属サーバーごとに別途ルールがありますのでそちらのルールも遵守してください。
</p>

<p>以下の行為が発覚した場合、アジ鯖全体での処罰がなされます。</p>

<p>
    ・正規のMinecraftクライアントを改造し、公平性を損なう有利を得る行為<br>
    ・外部ツールやハード等を用いて、バニラで可能な動作の高速化や一連の動作の自動化を行う行為<br>
    ・暴言・反社会的発言等、nick機能やprefix変更機能を含む名前やスキン、チャットによる不適切な表現<br>
    ・チャットガイドラインに違反する行為<br>
    ・不法行為及び、各種規約違反<br>
    ・アジ鯖にとって不利益となる行為<br>
    ・運営のモチベーションを奪う行為<br>
    ・その他、運営が不適切と判断した場合(アジ鯖利用規約 第二条第四項)<br>
</p>

<p>
    2021年7月7日 施行<br>
    2021年12月25日 改正<br>
    2022年5月15日 改正<br>
    2022年8月22日 改正<br>
    2022年11月17日 改正<br>
</p>

<h5>注意</h5>
<p>
    改造の定義を「ファイル(.jarなど)の編集、メモリのデータの書き換えや、ブロックやエンティティのモデル若しくはシェーダーを編集して有利を得られるリソースパックを使用する行為」とする<br>
    処罰期間中に他アカウントによる処罰回避が見受けられた場合は、当該アカウントにも同様の処分が適用される(運営が処罰されたユーザーのサブアカウントだと認識した場合に適用される)<br>
    プレイヤー同士のトラブルは、ルール上処罰されるべき行為を確認できた場合を除き、運営は一切関与しない<br>
</p>

<p>
    もし違反を見つけた場合は、<Link
        href="https://discord.gg/azisaba"
        target="_blank">Discord</Link
    >まで報告をお願いいたします。
</p>
